[
  {
    "Id": "97851",
    "ThreadId": "29364",
    "Html": "Hi,<br>\r\n<br>\r\nWe have a windows application which uses SQL Server 2000 and\r\nAnalysis Services 2000. Our product makes use of the Virtual Cubes\r\nfeature in AS 2000.<br>\r\n<br>\r\nMoving ahead we intend to use SQL Server\r\n2005 and Analysis Services 2005 (which doesn't support virtual cubes).\r\nAs recommended we plan to go for linked measure groups as a replacement\r\nfor virtual cubes. I did try things with the 'Linked Object Wizard' and\r\nI can see summary data in my cube containing linked measure groups.<br>\r\n<br>\r\nHowever it doesn't work when I do things using AMO.<br>\r\nI\r\nhave a template cube (containing default measure, dimensions, measure\r\ngroups). During the service run as and when a data cube is created\r\n(cloned from the template cube), I create a cube named Overall cube\r\n(again cloned from the template cube). I link the measure group in the\r\ndata cube to the Overall Cube. Now when the Overall cube is processed\r\nit gives an error saying -<br>\r\n&quot;Microsoft.AnalysisServices.OperationException:\r\nErrors in the metadata manager. The 'GPRS_Overall' cube has a measure\r\nwith the ID of 'CDR ID' in more than one measure group.&quot;<br>\r\n<br>\r\nWhen I\r\ndelete the 1st measure group (the one which comes at the time of\r\ncloning) from the Overall cube, the processing goes well and I'm able\r\nto browse the Overall cube.<br>\r\n<br>\r\nThings work fine till the time the\r\nsecond data cube is created. I drop the existing Overall cube, recreate\r\nit by cloning from the template cube and link measure groups from both\r\nthe data cubes. Now, I'm removing the 1st measure group and then\r\nattempting the processing, but it still gives the same error. <img src=\"http://www.ssas-info.com/forum/images/smilies/icon_e_sad.gif\" alt=\":(\" title=Sad> <br>\r\n<br>\r\nI'm using <em><code>&lt;CubeName&gt;.LinkMeasureGroup(sourceMeasureGroup, dataSourceId, measureGroupName)</code></em> to link the measure groups.<br>\r\n<br>\r\nI tried to evade the cloning path and created a cube using AMO. Then I\r\nlinked measure groups from each of the data cubes. One thing which I\r\nobserved here is that the server assigns IDs to the measure when I make\r\na call to &lt;CubeName&gt;.LinkMeasureGroup(sourceMeasureGroup,\r\ndataSourceId, measureGroupName)<br>\r\nI can't alter the measure ID, though I can change the measure name. &lt;!-- m --&gt;<a href=\"http://msdn.microsoft.com/en-us/library/ms127747.aspx\">http://msdn.microsoft.com/en-us/library/ms127747.aspx</a>&lt;!-- m --&gt; confirms the same.<br>\r\n<br>\r\nAt the end of all the exercise I get back to the same error  <img src=\"http://www.ssas-info.com/forum/images/smilies/icon_cry.gif\" alt=\":cry:\" title=\"Crying or Very Sad\"> <br>\r\n<br>\r\nLet me know of any suggestions. A sample code which creates linked measure groups would be a big help.<br>\r\n<br>\r\nTIA,<br>\r\nArun\r\n",
    "PostedDate": "2008-06-09T21:35:40.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]